Repository: 84000/data-translation-memory
Catalog: toh344-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སངས་རྒྱས་ཀྱི་རྟོགས་པ་བརྗོད་པ་ཤེས་ལྡན་གྱི་མདོ།
en: An Account of the Noble Deeds of the Buddha The Sūtra of Jñānaka

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡུམ་གྱི་དོན་དུ་ལྷ་རྣམས་ཀྱི་གནས་སུམ་ཅུ་རྩ་གསུམ་ན་ཤིང་ཡོངས་འདུ་ས་བརྟོལ་གྱི་དྲུང་ན་ལ་བ་དཀར་པོ་ལྟ་བུའི་རྡོ་ལེབ་ལ་བཞུགས་སོ།
en: The Blessed One was staying among the gods of the Heaven of the Thirty-Three for the benefit of his mother. He was seated in front of the Pāriyātra tree upon the Pāṇḍukambala rock.

source: །དེར་ལྷའི་བུ་ཞིག་ལ་འཆི་བའི་སྔ་ལྟས་ངན་པ་ལྔ་བྱུང་སྟེ།
en: There was a god there experiencing the five ominous signs of death:

source: ཕྲེང་རྒྱན་རྙིངས་པ་དང་། གོས་རྙིངས་པ་དང་། ལུས་དྲི་ང་བར་གྱུར་པ་དང་། མཆན་ཁུང་ནས་རྔུལ་འཛག་པ་དང་། རང་གི་སྟན་ལ་དགའ་བ་མེད་པར་གྱུར་ཏོ། །སྐྱེ་བ་ཡང་མཐོང་སྟེ།
en: his garlands had withered, his clothes had started to deteriorate, his body had started to smell, sweat dripped from his armpits, and he felt unhappy on his seat.

source: ཡངས་པའི་ཕག་གི་མངལ་དུ་སྐྱེ་བར་མཐོང་ངོ་། །དེས་དེ་མཐོང་ནས་མྱ་ངན་གྱིས་ཐེབས། སྨྲེ་སྔགས་འདོན།
en: This god foresaw his rebirth in the womb of a pig in Vaiśālī, causing him to be overcome with misery and cry out in woe.

source: བྲང་རྡུང་ཞིང་ངུ་ལ་ཤིན་ཏུ་མོང་མོང་པོར་གྱུར་ཏོ།
en: He beat his chest as he wept uncontrollably.

source: །དེ་ནས་ལྷའི་བུ་གཞན་ཞིག་ལྷའི་བུ་དེ་ག་ལ་བ་དེར་སོང་སྟེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་བུ་ཁྱོད་འཆི་བས་འཇིགས་སམ།
en: Another god approached him and asked, “Deva, is it death that you fear?”

source: སྨྲས་པ། ལྷའི་བུ་བདག་འཆི་བས་འཇིགས་སོ། །ལྷའི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Indeed, fellow deva,” he responded, “it is death that I fear.

source: བདག་ལྷ་རྣམས་ཀྱི་གནས་སུམ་ཅུ་རྩ་གསུམ་འདིར་ལྷའི་བཟའ་བ་ནི་ཟོས། ལྷའི་བཏུང་བ་ནི་འཐུངས། ལྷའི་བགོ་བ་ནི་བགོས་ན།
en: Well, fellow deva, I have eaten divine foods, imbibed divine drinks, and worn divine garments here among the gods of the Heaven of the Thirty-Three.

source: དེ་ནས་ཕྱིར་ཡངས་པའི་ཕག་གི་མངལ་དུ་སྐྱེ་བར་མཐོང་སྟེ། དེར་བདག་བཤང་བ་ཟ་ཞིང་མཚོན་གྱིས་འཆི་བར་འགྱུར་ཏེ།
en: Thus, as I behold my rebirth in the womb of a pig in Vaiśālī, I see that I will eat excrement and be killed by a blade.

source: ལྷའི་བུ་དེ་ལྟ་བས་ན་བདག་འཆི་བས་འཇིགས་སོ། །སྨྲས་པ།
en: These are the reasons, fellow deva, that I fear death.”

source: ལྷའི་བུ་ཁྱོད་འཆི་བས་མ་འཇིགས་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Do not be afraid of death, my fellow deva!

source: ལྷའི་བུ་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་ཡུམ་གྱི་དོན་དུ་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་འདི་ན་ཤིང་ཡོངས་འདུ་ས་བརྟོལ་གྱི་དྲུང་ན་ལ་བ་དཀར་པོ་ལྟ་བུའི་རྡོ་ལེབ་ལ་བཞུགས་ཏེ།
en: Well, fellow deva, the Blessed One—the thus-gone, worthy, perfect Buddha—is residing here in the Heaven of the Thirty-Three for the benefit of his mother. He is seated in front of the Pāriyātra tree upon the Pāṇḍukambala rock.

source: ཅི་སྟེ་ལྷའི་བུ་ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལ་ཕྱག་ཚོལ་དང་། བཅོམ་ལྡན་འདས་དེ་འདིར་གཤེགས་ཏེ།
en: Deva, you should by all means pay homage to the Blessed One.

source: དེས་ཁྱོད་ངན་སོང་རྣམས་ལས་གྲོལ་བར་མཛད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: He will come here to save you from the lower realms.

source: ལྷའི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་ཐུགས་རྗེ་ཆེན་པོས་སེམས་ཅན་ཡོངས་སུ་མ་བཏང་བ་ཡིན་ནོ།
en: Fellow deva, the blessed Buddha has great compassion and never forsakes beings.”

source: །དེ་ནས་ལྷའི་བུ་དེ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: The god then rose from his seat, draped his upper robe over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཆེད་དུ་བརྗོད་པ་འདི་ཆེད་དུ་ལན་གསུམ་བརྗོད་དེ།
en: With his palms joined, he bowed in the direction of the Blessed One and repeated this entreaty three times:

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: “Homage to the blessed Thus-Gone One!

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་དེ་འདིར་གཤེགས་སུ་གསོལ།
en: Homage to the blessed Thus-Gone One!

source: བདག་ངན་སོང་དུ་སྐྱེ་བ་རྣམས་ལས་གྲོལ་བར་མཛད་དུ་གསོལ།
en: Out of love for me, may the Blessed One please come here and save me from the lower realms!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེའི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས། ལྷའི་བུ་དེ་ག་ལ་བ་དེར་གཤེགས་ཏེ་གདན་བཤམས་པ་དེ་ལ་བཞུགས་སོ།
en: Aware of the sincere intent of that god, the Blessed One went to him and sat upon a seat that had been prepared.

source: །བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལྷའི་བུ་ཁྱོད་འཆི་བས་འཇིགས་སམ།
en: After taking his seat, the Blessed One asked that god, “Deva, is it death that you fear?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་འགུམ་པས་འཇིགས་ལགས་སོ།
en: “Indeed, Blessed One,” the god responded, “I am afraid to die.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། ཡངས་པའི་ཕག་གི་མངལ་མི་སྡུག་པར་སྐྱེ་བར་མཐོང་ལགས་ཏེ།
en: Because I foresaw my rebirth in the wretched womb of a pig in Vaiśālī.

source: དེར་བདག་སྐྱེས་ནས་བཤང་བ་འཚལ་ཞིང་མཚོན་གྱིས་འགུམ་པར་འགྱུར་ལགས་ཏེ།
en: Once reborn there, I will eat excrement and be killed by a blade.

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བདག་འགུམ་པས་འཇིགས་ལགས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: That is why, Blessed One, I am afraid to die.”

source: །ལྷའི་བུ་ཁྱོད་འཆི་བས་མ་འཇིགས་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The Blessed One said, “Deva, do not be afraid of death!

source: ལྷའི་བུ་སའི་ཁམས་དང་། ཆུའི་ཁམས་མི་འགྲོ་མི་འོང་གི་བདག་ཉིད་ཀྱི་ལས་ཀྱིས་འོང་ཞིང་འགྲོ་སྟེ།
en: Well, deva, it is not the earth and water elements that transmigrate here and there, but rather your own actions.

source: ལྷའི་བུ་ཁྱོད་ཚུར་ཤོག །སངས་རྒྱས་ལ་སྐྱབས་སུ་སོང་ཤིག །ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་སོང་ཤིག །དེ་ནས་ལྷའི་བུ་དེ་སྟན་ལས་ལངས་ཏེ།
en: Come here, deva. Take refuge in the Buddha. Take refuge in the Dharma and in the Saṅgha.” The god then rose from his seat and addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ།
en: “Yes, Blessed One, I will.

source: །བདག་སངས་རྒྱས་ལ་སྐྱབས་སུ་མཆིའོ།
en: I take refuge in the Buddha!

source: །ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ།
en: I take refuge in the Dharma and in the Saṅgha!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: The Blessed One responded to the god with the following stanza:

source: གང་ཞིག་སངས་རྒྱས་ལ་ནི་སྐྱབས་སོང་བ།
en: “Those who have taken refuge in the Buddha

source: །དེ་ནི་ངན་འགྲོར་འདིར་ནི་མི་འགྲོ་སྟེ།
en: Will be spared transmigrating to the lower realms.

source: །ལྷ་ཡི་བདག་ཉིད་དངོས་པོ་སྤངས་ནས་སུ།
en: As they relinquish their divine existence,

source: །མི་ཡི་བདག་ཉིད་དངོས་པོ་ལེན་པར་འགྱུར།
en: They will take up a human existence instead.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད།
en: The Blessed One then delivered a discourse on the Dharma to the god and ensured that the god retained it.

source: ཡང་དག་པར་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་བཞུད་དོ།
en: Having inspired the god and filled him with delight, the Blessed One rose from his seat and departed.

source: །བཅོམ་ལྡན་འདས་བཞུད་ནས་རིང་པོ་མ་ལོན་པར་ལྷའི་བུ་དེ་འཆི་བའི་དུས་བྱས་སོ།
en: Not long thereafter, the god passed away.

source: །དུས་བྱས་ནས་དེ་མ་ཐག་ཏུ་ཡངས་པ་དེར་ཚོང་དཔོན་ཞིག་གི་ཆུང་མ་དམ་པའི་མངལ་དུ་སྐྱེས་སོ།
en: He was immediately reborn in the womb of a noble merchant’s wife in Vaiśālī.

source: །དེ་ཟླ་བ་དགུ་འདས་ནས་ཁྱེའུ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་བཙས་པར་གྱུར་ཏོ།
en: After nine months had come to pass, an adorable child with a charming appearance and the most exquisite complexion was born.

source: །དེ་བཙས་མ་ཐག་ཏུ་ཚིག་འདི་སྐད་ཅེས་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ།
en: The moment he was born he exclaimed, “Homage to the Buddha!

source: །ཆོས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Dharma!

source: །དགེ་འདུན་ལ་ཕྱག་འཚལ་ལོ་ཞེས་བརྗོད་དོ།
en: Homage to the Saṅgha!”

source: །དེ་ནས་དེའི་ཚེ་ཕ་དང་མ་འདི་སྙམ་དུ་སེམས་ཏེ། ཁྱེའུ་འདི་ནི་སངས་རྒྱས་ཤེས། ཆོས་ཤེས་དགེ་འདུན་ཤེས་ཏེ།
en: At that moment, his parents thought, “This child knows of the Buddha, the Dharma, and the Saṅgha.

source: འདི་ནི་ཤེས་པ་དང་ལྡན་ནོ་སྙམ་དུ་འདུ་ཤེས་སྐྱེས་སོ།
en: He possesses knowledge.”

source: །དེ་ནས་ཁྱེའུ་ཤེས་ལྡན་གང་གི་ཚེ་ལོ་བརྒྱད་ལོན་པ་ལྟ་བུར་གྱུར་པ་དེའི་ཚེ་ལི་ཙྪ་བཱི་གཞོན་ནུ་རབ་ཏུ་མང་པོ་རྣམས་ཀྱིས་ལྷན་ཅིག་ཏུ་མདུན་དུ་བདར་ནས་སྐྱེད་མོས་ཚལ་གྱི་བཞི་མདོ་ནས་བྱུང་ངོ་།
en: Once, when this child Jñānaka was around eight years old, he and a group of Licchavi youths, who were in his company, arrived at a crossroads in a park.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཡངས་པའི་ཚལ་ཆེན་པོ་ན་ཁང་པ་བརྩེགས་པའི་ཁང་བཟངས་ན་བཞུགས་ཏེ།
en: At that time the Blessed One was staying at a mansion in the great grove of Vaiśālī.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་སྨད་གཡོགས་དང་ཆོས་གོས་གསོལ། ལྷུང་བཟེད་བསྣམས་ཏེ། ཡངས་པར་བསོད་སྙོམས་ལ་ཕྱིར་གཤེགས་སོ།
en: At dawn, the Blessed One donned his lower garment, dressed in his robes, picked up his alms bowl, and went to Vaiśālī on an alms round.

source: །བཅོམ་ལྡན་འདས་དེ་མཛེས་པ་ནས་འོད་དང་ལྡན་པའི་བར་དུ་གྱུར་པ་ཁྱེའུ་ཤེས་ལྡན་གྱིས་མཐོང་ངོ་། །མཐོང་ནས་དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་རབ་ཏུ་དགའ་བར་གྱུར་ཏོ། །སེམས་དགའ་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: The child Jñānaka caught sight of the Blessed One, who was handsome, and so forth, up until shining. Filled with joy at seeing the Blessed One, he happily went before the Blessed One and bowed his head to his feet, circled him three times, and sat to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཁྱེའུ་ཤེས་ལྡན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Seated to one side, the child Jñānaka spoke to the Blessed One in verse:

source: བདག་གིས་སྔོན་གྱི་ཚེ་དྲན་ཏེ།
en: “I have recollected a past life In which the Lord of the World

source: སྡུག་བསྔལ་རྣམས་ལས་རབ་བཀྲོལ་ཞིང་།
en: Saved me from suffering

source: །ངན་སོང་ལྟུང་བ་ལས་ནི་བདག །འཇིག་རྟེན་མགོན་གྱིས་གྲོལ་བར་མཛད།
en: And delivered me from falling to the lower realms.

source: །མི་མཆོག་ཐུགས་ནི་བརྩེར་དགོངས་ཏེ།
en: “Foremost of humans, would you be so kind

source: །བསོད་སྙོམས་འདི་ནི་བཞེས་པར་མཛོད། །བདག་གི་གདུགས་ཚོད་འདི་དག་ནི།
en: As to accept this gift of alms?

source: །གྲོལ་བར་མཛད་ནས་དེང་བཞེས་ལ།
en: Please accept this midday meal today For having saved me so. “Please think kindly as I invite you

source: །སང་ནི་བདག་གི་ཕ་མ་ཡི། །སྡུམ་པར་འདྲེན་པས་བརྩེར་དགོངས་ཏེ།
en: To my parents’ home tomorrow.

source: །དགེ་སློང་ཀུན་དང་ཐབས་ཅིག་ཏུ།
en: Together with all of your monks

source: །གདུགས་ཚོད་དག་ནི་གསོལ་བར་མཛོད།
en: Please come to partake of a midday meal.”

source: །བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་པས་ཁྱེའུ་ཤེས་ལྡན་གྱིས་གསོལ་པ་གནང་ངོ་།
en: The Blessed One remained silent, signaling his acceptance of the child Jñānaka’s request.

source: །དེ་ནས་ཁྱེའུ་ཤེས་ལྡན་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གནང་བར་རིག་ནས་ཕ་མ་ག་ལ་བ་དེར་སོང་སྟེ། ཕ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཡབ་ཡུམ་བདག་གིས་ནི་བཅོམ་ལྡན་འདས་ལ་བསོད་སྙོམས་ཕུལ་ལགས་ཏེ། སང་ཡང་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་སོ།
en: Aware that the Blessed One had accepted by not speaking, the child Jñānaka went before his parents and announced, “Dear father and mother, I offered alms to the Blessed One and have invited him tomorrow for a midday meal.”

source: །དེ་ནས་ཁྱེའུ་ཤེས་ལྡན་གྱི་ཕ་མ་མགུ་ཞིང་དགའ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: The parents of the child Jñānaka were pleased and rejoiced, full of happiness and delight.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་དེའི་མཚན་མོ་བཟའ་བ་དང་བཅའ་བ་རོ་དང་ལྡན་པ་ཞིམ་པ་མང་པོ་མངོན་པར་བཤམས་ནས་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ཐམས་ཅད་ཕྱག་དར་བྱས་ཏེ།
en: Filled with joy and elation, they arranged a spread of delicious foods and tasty delicacies that very night. They had the entire city of Vaiśālī swept clean and strung with silk tassels.

source: དར་གྱི་ལྡ་ལྡི་བཏགས། པོག་ཕོར་ནས་སྤོས་ཀྱིས་བདུགས། སྤོས་ཆུས་ཆག་ཆག་བཏབ། མེ་ཏོག་གིས་མཛེས་པར་བཀྲམ་སྟེ།
en: They lit incense in incense burners, sprinkled fragrant water, and elegantly scattered flowers.

source: དེའི་མཚན་མོ་འདས་ནས་དུས་ལ་བབ་པ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ། བཙུན་པ་བཅོམ་ལྡན་འདས་གདུགས་ཚོད་ལ་བབ་སྟེ།
en: When the night had passed and the appropriate time had come, they went to the Blessed One and said, “Honorable One, Blessed One, it is time for the midday meal.

source: གདུགས་ཚོད་སྦྱར་ལགས་སོ་ཞེས་གསོལ་ཏོ།
en: The food is ready.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེའི་སྔ་དྲོ་སྨད་གཡོགས་དང་ཆོས་གོས་གསོལ། ལྷུང་བཟེད་བསྣམས་ནས།
en: At dawn, the Blessed One donned his lower garment, dressed in his robes, and picked up his alms bowl.

source: དགེ་སློང་གི་ཚོགས་ཀྱིས་མདུན་དུ་བདར་ཅིང་། དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཏེ། ཤེས་ལྡན་གྱི་ཕ་མའི་ཁྱིམ་ག་ལ་བ་དེར་གཤེགས་ནས་གདན་བཤམས་པ་དེ་ལ་བཞུགས་སོ།
en: Escorted and encircled by an assembly of monks, he went to the home of Jñānaka’s parents where they sat upon seats that had been prepared for them.

source: །དེ་ནས་ཁྱེའུ་ཤེས་ལྡན་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་གདན་ལ་བཞུགས་པར་རིག་ནས་རང་གི་ལག་གིས་བཟའ་བ་དང་། བཅའ་བ་རོ་དང་ལྡན་པ་ཞིམ་ཞིང་མང་བ་དག་ལེགས་པར་བྲིམས་ལེགས་པར་གསོལ་ཏོ།
en: Noticing that the Blessed One and the saṅgha of monks were seated, the child Jñānaka brought forth many delicious foods and tasty delicacies, offering them carefully with his own hands.

source: །བཅོམ་ལྡན་འདས་གདུགས་ཚོད་གསོལ་བར་རིག་ནས། སོ་སོ་སོ་སོ་ལ་རས་བཅོས་བུ་ཟུང་དང་། སོ་སོ་ལ་ལྷམ་ཟུང་དག་ཕུལ་ལོ། །བཅོམ་ལྡན་འདས་ལ་ཆོས་གོས་སར་པ་གསུམ་དང་། ཆགས་སར་པ་ཟུང་དག་གསོལ་ཏོ།
en: Seeing that the Blessed One had finished his midday meal, he presented a set of cotton robes and a pair of sandals to each member of the saṅgha, and three new robes and a pair of new shoes to the Blessed One.

source: །གསེར་གྱི་མེ་ཏོག་དང་། དངུལ་གྱི་མེ་ཏོག་རྣམས་ཀྱིས་གཏོར་ཏོ། །གང་མངོན་པར་གཏོར་བ་དེ་དག་གཏོར་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་མཐུས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་གཙུག་གི་ཐད་ཀར་ཁང་པ་བརྩེགས་པ་བཀྲ་བ། བལྟ་ན་སྡུག་པ། གྲུ་བཞི་པ། གནས་བཞི་དང་ལྡན་པ་ཞིག་འདུག་པར་གྱུར་ཏོ།
en: He scattered gold and silver flowers that, through the power of the Buddha, immediately transformed above the Blessed One’s head into a glistening, elegant mansion with four corners and four rooms.

source: །ཁང་པ་བརྩེགས་པ་དེར་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་ཆོས་འཆད་ཅིང་བཞུགས་པ་དེས་མཐོང་ངོ་།
en: Within this mansion, the child Jñānaka beheld the figure of the Thus-Gone One sitting cross-legged and teaching the Dharma.

source: །དེ་ནས་ཁྱེའུ་ཤེས་ལྡན་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་གཟུགས་དང་། རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་འདྲ་བ་མཐོང་ནས་མགུ་ཞིང་དགའ་བ་ནས། ཡིད་བདེ་བ་སྐྱེས་པའི་བར་དུ་གྱུར་ནས།
en: As he observed the Blessed One’s inconceivable form, miracles, and supernatural powers, the child Jñānaka was joyful, elated, and filled with happiness.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གི་དགེ་བའི་རྩ་བ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོ་སྟེ།
en: He said to the Blessed One, “Blessed One, I dedicate my roots of virtue to unsurpassed and completely perfect awakening.

source: དགེ་བའི་རྩ་བ་དེས་ན་བདག་ད་ལྟར་གྱི་བཅོམ་ལྡན་འདས་བཞིན་དུ། སངས་རྒྱས་སུ་གྱུར་ཅིག །ཆོས་སྟོན་པར་ཡང་གྱུར་ཅིག །དགེ་འདུན་ཡོངས་སུ་སྐྱོང་བར་ཡང་གྱུར་ཅིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་ཤེས་ལྡན་གྱི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་དེ།
en: May these roots of virtue lead me to awaken, teach the Dharma, and sustain the saṅgha just like the present Blessed One.”

source: འཛུམ་པ་མཛད་ནས་སྤྱི་བོའི་གཙུག་གི་ནང་དུ་ནུབ་པའི་བར་དུ་མཛད་པ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་མཐོང་སྟེ། དོན་མེད་པ་མི་མཛད་དོ་སྙམ་པའི་བར་དུའོ།
en: Aware of the intent of the child Jñānaka, the Blessed One smiled, and so forth, up until the light dissolved into the crown of his head. The venerable Ānanda saw this and thought to himself, “There is nothing that the Blessed One does without purpose,” and so forth, up until “What is the reason?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་དེ་སླར་བཀའ་སྩལ་པ།
en: The Blessed One then addressed the venerable Ānanda with these verses:

source: ཀུན་དགའ་འདི་ལྟར་ཤེས་ལྡན་གྱིས་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པས་ན།
en: “Ānanda, by making offerings to the Thus-Gone One like this,

source: །བསྐལ་པ་བྱེ་བ་དགུ་བཅུ་དག་ཏུ་ལོག་པར་ལྟུང་བར་མི་འགྱུར་ལ།
en: Jñānaka will not fall to lower states for nine hundred million eons.

source: །དེ་ནས་དེ་མ་ཐག་ཏུ་རྣམ་པར་འདྲེན་པར་ཉེ་བར་སྐྱེ་འགྱུར་ཏེ།
en: He will, at that point, take rebirth and appear in the world as a guide,

source: །མཚན་ནི་མཁྱེན་གཙོ་རྒྱལ་པོ་ཞེས་བྱ་སངས་རྒྱས་འཇིག་རྟེན་འབྱུང་བར་འགྱུར།
en: As a buddha by the name of King of Foremost Knowing.

source: །སངས་རྒྱས་ཀྱི་ནི་རྟོགས་པ་བརྗོད་པས་མཁས་རྣམས་ཡང་དག་དགའ་བྱེད་ཅིང་།
en: “This account of the noble deeds of the Buddha delights the learned

source: །མི་ཡི་མཁས་པ་གང་གིས་ཐོས་ན་དགེ་བ་མང་པོ་བྱེད་འགྱུར་ཏེ། །རྒྱ་མཚོ་མཐས་གཏུགས་དཔག་མེད་ལྟ་བུའི་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ལ།
en: And engenders great virtue in the wise people who hear it.

source: །རབ་ཏུ་དང་བས་ཡོན་རྣམས་ཕུལ་བའི་འབྲས་བུ་ཆུང་བར་མི་འགྱུར་རོ།
en: Not so trivial are the results of gifts offered with lucid faith To the thus-gone Buddha, who is limitless like the extent of the ocean.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཁྱེའུ་ཤེས་ལྡན་དང་། དགེ་སློང་དེ་དག་དང་། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: After the Blessed One had spoken these words, the child Jñānaka, the monks, and the world with its gods rejoiced and praised what the Blessed One had taught.

source: །འཕགས་པ་སངས་རྒྱས་ཀྱི་རྟོགས་པ་བརྗོད་པ་ཤེས་ལྡན་གྱི་མདོ་རྫོགས་སོ།།
en: This completes “The Sūtra of Jñānaka: An Exemplary Tale of the Buddha.”

source: རྒྱ་གར་གྱི་མཁན་པོ་བིདྱཱ་ཀ་ར་སིང་ཧ་དང་། སརྦ་ཛྙཱ་དེ་བ་དང་། །​ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་དཔལ་བརྩེགས་ཀྱིས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།​།
en: This was translated, edited, and finalized by the Indian preceptors Vidyākarasiṃha and Sarvajñādeva, and the chief editor-translator, the venerable monk Paltsek.
